app/controllers/products_controller.rb

UPDATE "products" SET "title" = ?, "description" = ?, "image_url" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = 980190962  [["title", "Lorem Ipsum"], ["description", "Wibbles are fun!"], ["image_url", "lorem.jpg"], ["price", #<BigDecimal:52fcf38,'0.1995E2',18(18)>], ["updated_at", Tue, 18 Mar 2014 02:45:32 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)